source/buffalo/src/main/resources/soap.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<ns2:getModuleInfo xmlns:ns2="matp">
			<context>
				<clientId>6d32a827-23b0-4dce-b352-649cbd10ec17</clientId>
				<locale>
					<marshalled xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns4="http://marketcetera.org/types/util"
						xsi:type="ns4:marshalledLocale">
						<country>US</country>
						<language>en</language>
						<variant></variant>
					</marshalled>
				</locale>
				<versionId>1.0.0</versionId>
				<sessionId>25794653-f414-4cdb-a299-f07b60c5a04f</sessionId>
			</context>
			<urn>metc:mdata:bogus:single</urn>
		</ns2:getModuleInfo>
	</soap:Body>
</soap:Envelope>